MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC33FJ64MC802/mcu.h
#define _C1EC_TERRCNT0_POSITION                  0x00000008
#define _C1EC_TERRCNT0_MASK                      0x00000100
#define _C1EC_TERRCNT0_LENGTH                    0x00000001

#define _C1EC_TERRCNT1_POSITION                  0x00000009
#define _C1EC_TERRCNT1_MASK                      0x00000200
#define _C1EC_TERRCNT1_LENGTH                    0x00000001

#define _C1EC_TERRCNT2_POSITION                  0x0000000A
#define _C1EC_TERRCNT2_MASK                      0x00000400
#define _C1EC_TERRCNT2_LENGTH                    0x00000001

#define _C1EC_TERRCNT3_POSITION                  0x0000000B
#define _C1EC_TERRCNT3_MASK                      0x00000800
#define _C1EC_TERRCNT3_LENGTH                    0x00000001

#define _C1EC_TERRCNT4_POSITION                  0x0000000C
#define _C1EC_TERRCNT4_MASK                      0x00001000
#define _C1EC_TERRCNT4_LENGTH                    0x00000001

#define _C1EC_TERRCNT5_POSITION                  0x0000000D
#define _C1EC_TERRCNT5_MASK                      0x00002000
#define _C1EC_TERRCNT5_LENGTH                    0x00000001

#define _C1EC_TERRCNT6_POSITION                  0x0000000E
#define _C1EC_TERRCNT6_MASK                      0x00004000
#define _C1EC_TERRCNT6_LENGTH                    0x00000001

#define _C1EC_TERRCNT7_POSITION                  0x0000000F
#define _C1EC_TERRCNT7_MASK                      0x00008000
#define _C1EC_TERRCNT7_LENGTH                    0x00000001

#define _C1CFG1_BRP_POSITION                     0x00000000
#define _C1CFG1_BRP_MASK                         0x0000003F
#define _C1CFG1_BRP_LENGTH                       0x00000006

#define _C1CFG1_SJW_POSITION                     0x00000006
#define _C1CFG1_SJW_MASK                         0x000000C0
#define _C1CFG1_SJW_LENGTH                       0x00000002

#define _C1CFG1_BRP0_POSITION                    0x00000000
#define _C1CFG1_BRP0_MASK                        0x00000001
#define _C1CFG1_BRP0_LENGTH                      0x00000001

#define _C1CFG1_BRP1_POSITION                    0x00000001
#define _C1CFG1_BRP1_MASK                        0x00000002
#define _C1CFG1_BRP1_LENGTH                      0x00000001

#define _C1CFG1_BRP2_POSITION                    0x00000002
#define _C1CFG1_BRP2_MASK                        0x00000004
#define _C1CFG1_BRP2_LENGTH                      0x00000001

#define _C1CFG1_BRP3_POSITION                    0x00000003
#define _C1CFG1_BRP3_MASK                        0x00000008
#define _C1CFG1_BRP3_LENGTH                      0x00000001

#define _C1CFG1_BRP4_POSITION                    0x00000004
#define _C1CFG1_BRP4_MASK                        0x00000010
#define _C1CFG1_BRP4_LENGTH                      0x00000001

#define _C1CFG1_BRP5_POSITION                    0x00000005
#define _C1CFG1_BRP5_MASK                        0x00000020
#define _C1CFG1_BRP5_LENGTH                      0x00000001

#define _C1CFG1_SJW0_POSITION                    0x00000006
#define _C1CFG1_SJW0_MASK                        0x00000040
#define _C1CFG1_SJW0_LENGTH                      0x00000001

#define _C1CFG1_SJW1_POSITION                    0x00000007
#define _C1CFG1_SJW1_MASK                        0x00000080
#define _C1CFG1_SJW1_LENGTH                      0x00000001

#define _C1CFG2_PRSEG_POSITION                   0x00000000
#define _C1CFG2_PRSEG_MASK                       0x00000007
#define _C1CFG2_PRSEG_LENGTH                     0x00000003

#define _C1CFG2_SEG1PH_POSITION                  0x00000003
#define _C1CFG2_SEG1PH_MASK                      0x00000038
#define _C1CFG2_SEG1PH_LENGTH                    0x00000003

#define _C1CFG2_SAM_POSITION                     0x00000006
#define _C1CFG2_SAM_MASK                         0x00000040
#define _C1CFG2_SAM_LENGTH                       0x00000001

#define _C1CFG2_SEG2PHTS_POSITION                0x00000007
#define _C1CFG2_SEG2PHTS_MASK                    0x00000080
#define _C1CFG2_SEG2PHTS_LENGTH                  0x00000001

#define _C1CFG2_SEG2PH_POSITION                  0x00000008
#define _C1CFG2_SEG2PH_MASK                      0x00000700
#define _C1CFG2_SEG2PH_LENGTH                    0x00000003

#define _C1CFG2_WAKFIL_POSITION                  0x0000000E
#define _C1CFG2_WAKFIL_MASK                      0x00004000
#define _C1CFG2_WAKFIL_LENGTH                    0x00000001

#define _C1CFG2_PRSEG0_POSITION                  0x00000000
#define _C1CFG2_PRSEG0_MASK                      0x00000001
#define _C1CFG2_PRSEG0_LENGTH                    0x00000001

#define _C1CFG2_PRSEG1_POSITION                  0x00000001
#define _C1CFG2_PRSEG1_MASK                      0x00000002
#define _C1CFG2_PRSEG1_LENGTH                    0x00000001

#define _C1CFG2_PRSEG2_POSITION                  0x00000002
#define _C1CFG2_PRSEG2_MASK                      0x00000004
#define _C1CFG2_PRSEG2_LENGTH                    0x00000001

#define _C1CFG2_SEG1PH0_POSITION                 0x00000003
#define _C1CFG2_SEG1PH0_MASK                     0x00000008
#define _C1CFG2_SEG1PH0_LENGTH                   0x00000001

#define _C1CFG2_SEG1PH1_POSITION                 0x00000004
#define _C1CFG2_SEG1PH1_MASK                     0x00000010
#define _C1CFG2_SEG1PH1_LENGTH                   0x00000001

#define _C1CFG2_SEG1PH2_POSITION                 0x00000005
#define _C1CFG2_SEG1PH2_MASK                     0x00000020
#define _C1CFG2_SEG1PH2_LENGTH                   0x00000001

#define _C1CFG2_SEG2PH0_POSITION                 0x00000008
#define _C1CFG2_SEG2PH0_MASK                     0x00000100
#define _C1CFG2_SEG2PH0_LENGTH                   0x00000001

#define _C1CFG2_SEG2PH1_POSITION                 0x00000009
#define _C1CFG2_SEG2PH1_MASK                     0x00000200
#define _C1CFG2_SEG2PH1_LENGTH                   0x00000001

#define _C1CFG2_SEG2PH2_POSITION                 0x0000000A
#define _C1CFG2_SEG2PH2_MASK                     0x00000400
#define _C1CFG2_SEG2PH2_LENGTH                   0x00000001

#define _C1FEN1_FLTEN_POSITION                   0x00000000
#define _C1FEN1_FLTEN_MASK                       0x0000FFFF
#define _C1FEN1_FLTEN_LENGTH                     0x00000010

#define _C1FEN1_FLTEN0_POSITION                  0x00000000
#define _C1FEN1_FLTEN0_MASK                      0x00000001
#define _C1FEN1_FLTEN0_LENGTH                    0x00000001

#define _C1FEN1_FLTEN1_POSITION                  0x00000001
#define _C1FEN1_FLTEN1_MASK                      0x00000002
#define _C1FEN1_FLTEN1_LENGTH                    0x00000001

#define _C1FEN1_FLTEN2_POSITION                  0x00000002
#define _C1FEN1_FLTEN2_MASK                      0x00000004
#define _C1FEN1_FLTEN2_LENGTH                    0x00000001

#define _C1FEN1_FLTEN3_POSITION                  0x00000003
#define _C1FEN1_FLTEN3_MASK                      0x00000008
#define _C1FEN1_FLTEN3_LENGTH                    0x00000001

#define _C1FEN1_FLTEN4_POSITION                  0x00000004
#define _C1FEN1_FLTEN4_MASK                      0x00000010
#define _C1FEN1_FLTEN4_LENGTH                    0x00000001

#define _C1FEN1_FLTEN5_POSITION                  0x00000005
#define _C1FEN1_FLTEN5_MASK                      0x00000020
#define _C1FEN1_FLTEN5_LENGTH                    0x00000001

